0.57.2119-1/Catalogs/ККСНГ_Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ККСНГ_Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчастникаЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>47</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНастройкиОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникБанкаEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ3</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоговорыУВХД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорУВХД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККСНГ_ЭлектронныеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/CommonModules/ККСНГ_ЭлектронныеДокументы/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция получает значения инфополей для указанного документа по настройкам из профиля контрагента. 
//
// Параметры:
//	- ДокументСсылка - ДокументСсылка.* - Ссылка на документ ИБ
//	- ПрофильКонтрагента - СправочникСсылка.ККСНГ_Контрагенты - профиль контрагента, содержащий настройки получения инфополей.
//	- ТипИнфополей - строка - Необязательный параметр, задается как строка типов инфополей разделенных запятой.
//		Пример: "ИнфоФХЖ2,ИнфоФХЖ3", "ИнфоФХЖ1,ИнфоФХЖ3", "ИнфоФХЖ1". 
//	  Если параметр не задан, то будут получены значения всех настроенных инфополей профиля.
//
// Возвращаемое значение:
//
//  Ответ - Структура, см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета() 
Функция ПолучитьЗначенияИнфополейДокумента(ДокументСсылка, ПрофильКонтрагента, СчетФактураСсылка = Неопределено, ТипИнфополей = Неопределено) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	СтруктураЗначенийИнфополей = Новый Структура;
	МассивОшибокЗаполнения = Новый Массив;
	
	Если ЗначениеЗаполнено(ДокументСсылка)
		И Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДокументСсылка)) Тогда
		
		ИмяДокумента = "Документ." + ДокументСсылка.Метаданные().Имя;
	
		НастройкиИнфополей = ПолучитьНастройкиФормированияИнфополей(ИмяДокумента, ПрофильКонтрагента, ТипИнфополей);
			
		ПредставлениеДокумента = ПолучитьПредставлениеДокумента(ДокументСсылка, СчетФактураСсылка);
		
		ТаблицаЗначенийИнфополей = ПолучитьТаблицуИнфоПолей(НастройкиИнфополей, СчетФактураСсылка, ДокументСсылка);
		
		Для каждого КлючИЗначение Из НастройкиИнфополей Цикл
			
			МассивЗначенийИнфополей = Новый Массив;
			МассивНастроек = КлючИЗначение.Значение;
									
			Для каждого ЭлементНастройки Из МассивНастроек Цикл
				
				ПараметрыДанных = Новый Структура;
				ПараметрыДанных.Вставить("ЭлементНастройки", ЭлементНастройки);
				ПараметрыДанных.Вставить("ТаблицаЗначенийИнфополей", ТаблицаЗначенийИнфополей);
				ПараметрыДанных.Вставить("КлючИЗначение", КлючИЗначение);
				ПараметрыДанных.Вставить("МассивЗначенийИнфополей", МассивЗначенийИнфополей);
				ПараметрыДанных.Вставить("ПредставлениеДокумента", ПредставлениеДокумента);
				ПараметрыДанных.Вставить("Ответ", Ответ);
				
				Проверено = ПроверкаПолейЗаполненныхВручную(ПараметрыДанных);
				Если НЕ Проверено Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяПоля = "Инфополе_1";
				ТаблицаРезультат = ВычислитьЗначениеИнфополя(ЭлементНастройки, ДокументСсылка, ИмяПоля, МассивОшибокЗаполнения);
				
				ОбработатьЗначениеВычисления(ЭлементНастройки, ИмяПоля, ТаблицаРезультат, МассивЗначенийИнфополей, МассивОшибокЗаполнения);
				
			КонецЦикла;
											
			Если МассивЗначенийИнфополей.Количество() Тогда
				СтруктураЗначенийИнфополей.Вставить(КлючИЗначение.Ключ, МассивЗначенийИнфополей);	
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе // 
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьСообщение(Ответ.Журнал, "Некорректные параметры получения значений инфополей.");	
	КонецЕсли;
	
	СформироватьОтветПоИнфополям(Ответ, МассивОшибокЗаполнения, СтруктураЗначенийИнфополей, ПредставлениеДокумента);
	
	Возврат Ответ;
	
КонецФункции

// Функция вычисляет значение инфополя для указанного документа по настройкам из профиля контрагента. 
//
// Параметры:
//	- ЭлементНастройки - Структура, см. ККСНГ_ЭлектронныеДокументы.ПолучитьНастройкиФормированияИнфополей() - Настройка инфополя.
//	- ДокументСсылка - ДокументСсылка.* - Ссылка на документ ИБ
//	- ИмяПоля - Строка - Имя поля в СКД.
//	- МассивОшибокЗаполнения - Массив из Строка - При ошибках вычисления будет содержать ошибки. 
//
// Возвращаемое значение:
//  ТаблицаЗначений - содержит вычисленное значение инфополя. 
//
Функция ВычислитьЗначениеИнфополя(ЭлементНастройки, ДокументСсылка, ИмяПоля, МассивОшибокЗаполнения) Экспорт

	ТаблицаРезультат = Новый ТаблицаЗначений;
	ИмяТаблицы = ЭлементНастройки.Документ + ?(ЗначениеЗаполнено(ЭлементНастройки.ТабличнаяЧасть), "." + ЭлементНастройки.ТабличнаяЧасть, "");
	
	ТекстЗапроса = "ВЫБРАТЬ Первые 1 * ИЗ " + ИмяТаблицы + " ГДЕ Ссылка = &Ссылка";
		
	// Создаем схему компоновки
	СхемаКомпоновки = ККСНГ_ОбщегоНазначения.ПолучитьСхемуКомпоновкиДанныхИзЗапроса(ТекстЗапроса);
	
	// Настройки по умолчанию
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	
	// Обновляем настройки с учетом заданных отборов
	Если ТипЗнч(ЭлементНастройки.ХранилищеУсловий) = Тип("ХранилищеЗначения") Тогда
		УсловиеОтбора = ЭлементНастройки.ХранилищеУсловий.Получить();
	КонецЕсли;
	
	Если ТипЗнч(УсловиеОтбора) = Тип("НастройкиКомпоновкиДанных")  Тогда
		Попытка
			КомпоновщикНастроек.ЗагрузитьНастройки(УсловиеОтбора);
		Исключение
			
			ТекстОшибки = СтрШаблон("Ошибка настройки поля ""%1"" раздела %2.", 
			ЭлементНастройки.Идентификатор,
			ЭлементНастройки.ТипИнфополя);
			
			МассивОшибокЗаполнения.Добавить(ТекстОшибки);
			
		КонецПопытки;
		
	КонецЕсли;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	// Задаем параметры
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Ссылка"));
	Параметр.Использование = Истина;
	Параметр.Значение = ДокументСсылка;
		
	// Добавляем все поля таблицы
	Структура = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Структура.Использование = Истина;
	Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
	Для каждого ДоступноеПоле Из Настройки.Выбор.ДоступныеПоляВыбора.Элементы Цикл
		Если НЕ ДоступноеПоле.Папка Тогда
			ВыбранноеПоле = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = ДоступноеПоле.Поле;
		КонецЕсли;
	КонецЦикла;
	
	// Добавляем вычисляемые поля
	ГруппаИнфополей = Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаИнфополей.Заголовок = "Инфополя";
	
	ФормулаАдаптированная = ЭлементНастройки.Формула;
	ОткрывающийсяРазделитель = ККСНГ_ОбщегоНазначенияКлиентСервер.ОткрывающийсяРазделитель(ФормулаАдаптированная);
	ЗакрывающийсяРазделитель = ККСНГ_ОбщегоНазначенияКлиентСервер.ЗакрывающийсяРазделитель(ФормулаАдаптированная);
	ФормулаАдаптированная = СтрЗаменить(ФормулаАдаптированная, ОткрывающийсяРазделитель, "");
	ФормулаАдаптированная = СтрЗаменить(ФормулаАдаптированная, ЗакрывающийсяРазделитель, "");
	
	ВычисляемоеПоле = СхемаКомпоновки.ВычисляемыеПоля.Добавить();
	ВычисляемоеПоле.ПутьКДанным = ИмяПоля;
	ВычисляемоеПоле.Выражение = ФормулаАдаптированная;
	
	ВыбранноеПоле = ГруппаИнфополей.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	
	ВыбранноеПоле.Заголовок = ЭлементНастройки.Идентификатор;
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	
	// Компоновка и вывод в таблицу
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Попытка
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
		
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		
		ТекстОшибки = СтрШаблон("Ошибка вычисления значения поля ""%1"" раздела %2.",
		ЭлементНастройки.Идентификатор,
		ЭлементНастройки.ТипИнфополя);
		МассивОшибокЗаполнения.Добавить(ТекстОшибки);
		
	КонецПопытки;
	
	Пока ТаблицаРезультат.Количество() > 1 Цикл
		ТаблицаРезультат.Удалить(ТаблицаРезультат.Количество() - 1);
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

// Получение количества документов в разделе
//
// Параметры:
//	ДанныеФормированияЗапросовРазделов - Структура - Содержит разделы формы работы с документами ЭД:
//   * Ключ	                           - Строка    - Имя раздела
//   * Значение	                       - Структура - Данные для запроса по разделу
//     ** ПараметрыЗапроса	           - Структура - Данные для запроса по разделу
//       *** Actions	               - Массив
//       *** Statuses	               - Массив
//       *** ИспользоватьОтборДействий - Булево
//       *** ИспользоватьОтборСтатусов - Булево
//       *** ОтборПоЗавершенным	Ложь   - Булево
//       *** ОтборПоНеПринятымКУчету   - Булево
//       *** ПрофильНастройкиЭДО	   - СправочникСсылка.ККСНГ_Организации
//     ** ТекстЗапроса                 - Строка
//	АдресХранилищаРезультата           - Строка     - Адрес хранилища, результат выполнения
//
Процедура ПолучитьЗначенияСчетчиковРазделов(ДанныеФормированияЗапросовРазделов, АдресХранилищаРезультата) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(АдресХранилищаРезультата);
	
	ДанныеФормированияЗапросовРазделов = ЗначениеИзСтрокиВнутр(ДанныеФормированияЗапросовРазделов);
	
	//Результаты = Новый Соответствие();
	//Для каждого ДанныеФормированияЗапросаРаздела Из ДанныеФормированияЗапросовРазделов Цикл
	//	Раздел = ДанныеФормированияЗапросаРаздела.Ключ;
	//	ДанныеФормирования = ДанныеФормированияЗапросаРаздела.Значение;
	//	КоличествоСтрок = ПолучитьКоличествоСтрокИзДанныхФормирования(ДанныеФормирования);		
	//	Результаты.Вставить(Раздел, КоличествоСтрок);
	//КонецЦикла;
	
	Результаты = ВыполнитьРасчетКоличестваЭлементовВРазделах(ДанныеФормированияЗапросовРазделов);		
	
	Ответ.Успех = Истина;
	
	Ответ.Результат = Результаты;
	
	ПоместитьВоВременноеХранилище(Ответ, АдресХранилищаРезультата); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ДопПроцедурыИФункции

// Получает номер документа для вывода на печать; из номера удаляются префиксы и лидирующие нули
//
// Параметры:
//	НомерСтрокой - Строка
//
// Возвращаемое значение:
//	Строка
//
Функция ПолучитьНомерНаПечать(НомерСтрокой) Экспорт
		
	Возврат ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерСтрокой, Истина);
	
КонецФункции

// Получает номер документа для вывода на печать; из номера удаляются префиксы и лидирующие нули
//
// Параметры:
//	- ДокументСсылка - ДокументСсылка.* - Ссылка на документ ИБ
//
// Возвращаемое значение:
//	Строка
//
Функция ПолучитьНомерНаПечатьПоСсылке(ДокументСсылка) Экспорт
	
	НомерСтрокой = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Номер");
	
	Возврат ПолучитьНомерНаПечать(НомерСтрокой);
	
КонецФункции

// Возвращает структуру профиля СберКорус
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Структура
//
Функция ПрофильНастроекЭДОКорусКонсалтингСНГ() Экспорт
	
	ПрофильНастроекЭДО = Новый Структура;
	ПрофильНастроекЭДО.Вставить("ОператорЭДО", "ООО СберКорус (2BK)");
	ПрофильНастроекЭДО.Вставить("ОператорЭДОИНН", "7801392271");
	ПрофильНастроекЭДО.Вставить("ОператорЭДОИд", "2BK");
	
	Возврат ПрофильНастроекЭДО;
	
КонецФункции

#КонецОбласти

#Область РаботаСИнфополями

// Функция получает значения инфополей для указанного документа
//
// Параметры:
//	ДокументСсылка - Ссылка на документ
//	ИмяКлюча       - Строка
//	ИмяЗначения    - Строка
//
// Возвращаемое значение:
//	Массив структур ИмяКлюча-ИмяЗначения
//
Функция ПолучитьИнфоПоляМассивом(ДокументСсылка, ИмяКлюча, ИмяЗначения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ККСНГ_ПМ_ДопРеквизитыЭД.ИнфоПоля КАК ИнфоПоля
	|ИЗ
	|	РегистрСведений.ККСНГ_ПМ_ДопРеквизитыЭД КАК ККСНГ_ПМ_ДопРеквизитыЭД
	|ГДЕ
	|	ККСНГ_ПМ_ДопРеквизитыЭД.СвязанныйДокумент = &СвязанныйДокумент";
	
	Запрос.УстановитьПараметр("СвязанныйДокумент", ДокументСсылка);
	
	ВыборкаДопРеквизиты = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДопРеквизиты.Следующий() Тогда
		
		ИнфоПоля = ВыборкаДопРеквизиты.ИнфоПоля.Получить();
		Если ИнфоПоля = Неопределено Тогда
			Возврат Неопределено;	
		КонецЕсли;
		
		ДанныеИнфоПолей = ЗначениеИзСтрокиВнутр(ИнфоПоля);
		Если ТипЗнч(ДанныеИнфоПолей) = Тип("Массив") И ДанныеИнфоПолей.Количество() > 0 И ТипЗнч(ДанныеИнфоПолей[0]) = Тип("Структура") Тогда
			
			МассивРезультат = Новый Массив;
			
			Для каждого ТекущееПоле Из ДанныеИнфоПолей Цикл
				РезультатСтруктура = Новый Структура;
				РезультатСтруктура.Вставить(ИмяКлюча, ТекущееПоле.Key);
				РезультатСтруктура.Вставить(ИмяЗначения, ТекущееПоле.Value);
				МассивРезультат.Добавить(РезультатСтруктура);
			КонецЦикла;
			
			Возврат МассивРезультат;
			
		Иначе	
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	

КонецФункции

// Функция получает значения инфополей для указанного документа
//
// Параметры:
//	ДокументСсылка - Ссылка на документ
//
// Возвращаемое значение:
//	ТаблицаЗначений
// 		* ТипПоля
// 		* Идентиф
// 		* Значен
//			
Функция ПолучитьИнфоПоляТаблицей(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ККСНГ_ПМ_ДопРеквизитыЭД.ИнфоПоля КАК ИнфоПоля
	|ИЗ
	|	РегистрСведений.ККСНГ_ПМ_ДопРеквизитыЭД КАК ККСНГ_ПМ_ДопРеквизитыЭД
	|ГДЕ
	|	ККСНГ_ПМ_ДопРеквизитыЭД.СвязанныйДокумент = &СвязанныйДокумент";
	
	Запрос.УстановитьПараметр("СвязанныйДокумент", ДокументСсылка);
	
	ВыборкаДопРеквизиты = Запрос.Выполнить().Выбрать();
	
	ТаблицаРезультат = Неопределено;
	
	Если НЕ ВыборкаДопРеквизиты.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИнфоПоля = ВыборкаДопРеквизиты.ИнфоПоля.Получить();
	
	Если НЕ ИнфоПоля = Неопределено Тогда
		
		ДанныеИнфоПолей = ЗначениеИзСтрокиВнутр(ИнфоПоля);
		
		Если ТипЗнч(ДанныеИнфоПолей) = Тип("Массив") 
			И ДанныеИнфоПолей.Количество() > 0 
			И ТипЗнч(ДанныеИнфоПолей[0]) = Тип("Структура") Тогда
			
			ТаблицаРезультат = Новый ТаблицаЗначений;
			ТаблицаРезультат.Колонки.Добавить("ТипПоля");
			ТаблицаРезультат.Колонки.Добавить("Идентиф");
			ТаблицаРезультат.Колонки.Добавить("Значен");
			
			Для каждого ТекущееПоле Из ДанныеИнфоПолей Цикл
				СтрокаТаблицы = ТаблицаРезультат.Добавить();
				
				Если НЕ ТекущееПоле.Свойство("Type", СтрокаТаблицы.ТипПоля) Тогда
					СтрокаТаблицы.ТипПоля = "ИнфоФХЖ1";
				КонецЕсли;
				
				СтрокаТаблицы.Идентиф = ТекущееПоле.Key;
				СтрокаТаблицы.Значен = ТекущееПоле.Value;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат ТаблицаРезультат;
	
КонецФункции

// Функция получает настройки инфополей для указанного типа документа
//
// Параметры:
//	ИмяДокумента       - Строка
//	ПрофильКонтрагента - Справочник.ККСНГ_Контрагенты
//	ТипИнфополей       - ИнфоФХЖ1/2/3
//
// Возвращаемое значение:
//	Структура
// 		* ИнфоФХЖ1/2/3                             - Тип инфополей
// 		* СтруктураНастроекИнфополей.ИнфоФХЖ       - Структура:
// 			** Документ	                           - Строка
// 			** ДоступноЗаполнениеВручную	       - Булево
// 			** Идентификатор	                   - Строка
// 			** ОбязательноДляЗаполнения	           - Булево
// 			** Подсказка	                       - Строка
// 			** ТабличнаяЧасть	                   - Строка
// 			** ТипИнфополя	                       - Строка
// 			** Формула	                           - Строка
// 			** ХранилищеУсловий	                   - ХранилищеЗначения
//
Функция ПолучитьНастройкиФормированияИнфополей(ИмяДокумента, ПрофильКонтрагента, ТипИнфополей = Неопределено) Экспорт
	
	СтруктураНастроекИнфополей = Новый Структура;
	
	Если ТипИнфополей = Неопределено Тогда
		ОтборПоТипу = Ложь;
		МассивТипов = Неопределено;
	Иначе
		ОтборПоТипу = Истина;
		МассивТипов = СтрРазделить(ТипИнфополей, ",");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	""ИнфоФХЖ1"" КАК ТипИнфополя,
				   |	ИСТИНА КАК ОбязательноДляЗаполнения,
				   |	ИСТИНА КАК ДоступноЗаполнениеВручную,
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ1.Документ КАК Документ,
	               |	"""" КАК ТабличнаяЧасть,
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ1.Идентификатор КАК Идентификатор,
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ1.ХранилищеУсловий КАК ХранилищеУсловий,
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ1.Формула КАК Формула,
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ1.Подсказка КАК Подсказка
	               |ИЗ
	               |	Справочник.ККСНГ_Контрагенты.ИнформационныеПоляФХЖ1 КАК ККСНГ_КонтрагентыИнформационныеПоляФХЖ1
	               |ГДЕ
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ1.Ссылка = &ПрофильКонтрагента
	               |	И ККСНГ_КонтрагентыИнформационныеПоляФХЖ1.Документ = &ИмяДокумента
	               |	И ККСНГ_КонтрагентыИнформационныеПоляФХЖ1.Использовать
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоТипу
	               |				ТОГДА ""ИнфоФХЖ1"" В (&МассивТипов)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""ИнфоФХЖ2"",
				   |	ИСТИНА,
				   |	ЛОЖЬ,
				   |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ2.Документ,
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ2.ТабличнаяЧасть,
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ2.Идентификатор,
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ2.ХранилищеУсловий,
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ2.Формула,
	               |	""""
	               |ИЗ
	               |	Справочник.ККСНГ_Контрагенты.ИнформационныеПоляФХЖ2 КАК ККСНГ_КонтрагентыИнформационныеПоляФХЖ2
	               |ГДЕ
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ2.Ссылка = &ПрофильКонтрагента
	               |	И ККСНГ_КонтрагентыИнформационныеПоляФХЖ2.Документ = &ИмяДокумента
	               |	И ККСНГ_КонтрагентыИнформационныеПоляФХЖ2.Использовать
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоТипу
	               |				ТОГДА ""ИнфоФХЖ2"" В (&МассивТипов)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""ИнфоФХЖ3"",
				   |	ИСТИНА,
	               |	ИСТИНА,
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ3.Документ,
	               |	"""",
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ3.Идентификатор,
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ3.ХранилищеУсловий,
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ3.Формула,
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ3.Подсказка
	               |ИЗ
	               |	Справочник.ККСНГ_Контрагенты.ИнформационныеПоляФХЖ3 КАК ККСНГ_КонтрагентыИнформационныеПоляФХЖ3
	               |ГДЕ
	               |	ККСНГ_КонтрагентыИнформационныеПоляФХЖ3.Ссылка = &ПрофильКонтрагента
	               |	И ККСНГ_КонтрагентыИнформационныеПоляФХЖ3.Документ = &ИмяДокумента
	               |	И ККСНГ_КонтрагентыИнформационныеПоляФХЖ3.Использовать
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоТипу
	               |				ТОГДА ""ИнфоФХЖ3"" В (&МассивТипов)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |ИТОГИ ПО
	               |	ТипИнфополя";
	
	Запрос.УстановитьПараметр("ПрофильКонтрагента", ПрофильКонтрагента);
	Запрос.УстановитьПараметр("ИмяДокумента", ИмяДокумента);
	Запрос.УстановитьПараметр("ОтборПоТипу", ОтборПоТипу);
	Запрос.УстановитьПараметр("МассивТипов", МассивТипов);
	
	ВыборкаПоТипам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТипИнфополя");
	
	Пока ВыборкаПоТипам.Следующий() Цикл
		
		ВыборкаНастроек = ВыборкаПоТипам.Выбрать();
		МассивНастроек = Новый Массив;
		
		Пока ВыборкаНастроек.Следующий() Цикл
			МассивНастроек.Добавить(ККСНГ_ОбщегоНазначенияВызовСервера.СтрокаТаблицыЗначенийВСтруктуру(ВыборкаНастроек));
		КонецЦикла;
		
		Если МассивНастроек.Количество() Тогда
			СтруктураНастроекИнфополей.Вставить(ВыборкаПоТипам.ТипИнфополя, МассивНастроек);
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат СтруктураНастроекИнфополей;
	
КонецФункции

#КонецОбласти

#Область ПолучениеСтруктурыДокумента

// Возвращает структуру "ФИО" из "ККСНГ_DOCUMENT_1C"
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Структура
//
Функция СтруктураФИО() Экспорт
	
	ПустаяФИО = СтруктураПоТипуXDTO("ФИО", "ККСНГ_DOCUMENT_1C");
	Возврат ПустаяФИО;
	
КонецФункции

// Возвращает структуру "Адрес" из "ККСНГ_DOCUMENT_1C"
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Структура
//
Функция СтруктураАдрес() Экспорт
	
	ПустойАдрес = СтруктураПоТипуXDTO("Адрес", "ККСНГ_DOCUMENT_1C");
	Возврат ПустойАдрес;
	
КонецФункции

// Возвращает структуру "БанковскийСчет" из "ККСНГ_DOCUMENT_1C"
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Структура
//
Функция СтруктураБанковскийСчет() Экспорт
	
	ПустойБанковскийСчет = СтруктураПоТипуXDTO("БанковскийСчет", "ККСНГ_DOCUMENT_1C");
	Возврат ПустойБанковскийСчет;
	
КонецФункции

// Возвращает структуру "Документ" из "ККСНГ_DOCUMENT_1C"
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Структура
//
Функция СтруктураДанныхДокумента() Экспорт
	
	СтруктураДокумента = СтруктураПоТипуXDTO("Документ", "ККСНГ_DOCUMENT_1C");
	Возврат СтруктураДокумента;
	
КонецФункции

// Заполняет объект XDTO
//
// Параметры:
//	ОбъектXDTO         - Объект XDTO, произвольный
//	Данные             - Структура, произвольная
//
Процедура ЗаполнитьОбъектXDTOПоСтруктуре(ОбъектXDTO, Данные) Экспорт
	
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Для Каждого ЭлементКоллекцииСвойств Из ОбъектXDTO.Свойства() Цикл
		
		ЭлементДанных = ОбъектXDTO[ЭлементКоллекцииСвойств.Имя];
		Если ТипЗнч(ЭлементДанных) = Тип("СписокXDTO")
			И Данные.Свойство(ЭлементКоллекцииСвойств.Имя)
				И ТипЗнч(Данные[ЭлементКоллекцииСвойств.Имя]) = Тип("Массив") Тогда
				
			Для Каждого СтрокаДанных Из Данные[ЭлементКоллекцииСвойств.Имя] Цикл
				НовыйЭлемент = ФабрикаXDTO.Создать(ЭлементКоллекцииСвойств.Тип);
				Если НовыйЭлемент = Неопределено Тогда
					// Это конечный элемент
					НовыйЭлемент = СтрокаДанных;
				Иначе
					// Рекурсивно заполняем дальше
					ЗаполнитьОбъектXDTOПоСтруктуре(НовыйЭлемент, СтрокаДанных);
				КонецЕсли;
				ЭлементДанных.Добавить(НовыйЭлемент);
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(ЭлементКоллекцииСвойств.Тип) = Тип("ТипОбъектаXDTO") И ТипЗнч(ЭлементДанных) <> Тип("СписокXDTO") Тогда
			
			ЗначениеСвойства = Неопределено;
			Если Данные.Свойство(ЭлементКоллекцииСвойств.Имя, ЗначениеСвойства) И ЗначениеСвойства <> Неопределено Тогда
				ОбъектXDTO[ЭлементКоллекцииСвойств.Имя] = ФабрикаXDTO.Создать(ЭлементКоллекцииСвойств.Тип);
				ЗаполнитьОбъектXDTOПоСтруктуре(ОбъектXDTO[ЭлементКоллекцииСвойств.Имя], Данные[ЭлементКоллекцииСвойств.Имя]);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ЭлементКоллекцииСвойств.Тип) = Тип("ТипЗначенияXDTO") И Данные.Свойство(ЭлементКоллекцииСвойств.Имя) 
			И (ЭлементКоллекцииСвойств.ВозможноПустое Или ЗначениеЗаполнено(Данные[ЭлементКоллекцииСвойств.Имя])) Тогда
				
			ЗаполнитьЗначенияСвойств(ОбъектXDTO, Данные, ЭлементКоллекцииСвойств.Имя);	
			
		Иначе 
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Обновляет список доступных действий для существующих документов
//
// Параметры:
//  Объект     -  ККСНГ_ЭлектронныеДокументы
// 
//
Процедура ЗаполнитьДоступныеДействияКурьер(Объект) Экспорт
	
	Объект.DocumentActions.Очистить();
	
	ДоступныеДействияКурьер = ПолучитьДоступныеДействияДокументаКурьер(Объект);
	
	Для каждого ДоступноеДействияКурьер Из ДоступныеДействияКурьер Цикл
		Объект.DocumentActions.Добавить().Action = ДоступноеДействияКурьер.Ключ;		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДопПараметрыДокумента(ДанныеДокумента, ДопПараметры = Неопределено) Экспорт
	
	ДопПараметрыРезультат = Новый Массив();
	ДанныеЗапросаДопПараметров = Новый Структура();
		
	ДопПараметрыДокумента = ДополнительныеПараметрыДокумента(ДанныеДокумента, ДопПараметры);
	Если ДопПараметрыДокумента = Неопределено Тогда
		Возврат ДопПараметрыРезультат;		
	КонецЕсли;
	
	ДопПараметрыОбщийСписок = Новый Соответствие();
	Для каждого ДопПараметрДокумента Из ДопПараметрыДокумента Цикл
		ДопПараметрыОбщийСписок.Вставить(ДопПараметрДокумента.Ключ, ДопПараметрДокумента);
	КонецЦикла;
	
	ДопРеквизитыДокумента = ПрочитатьДополнительныеРеквизитыДокумента(ДанныеДокумента.ДокументСсылка);
	ДопПараметрыРезультат = ДополнитьДопПараметры(ДопПараметрыДокумента, ДопРеквизитыДокумента);
	
	Возврат ДопПараметрыРезультат;
	
КонецФункции

Функция ДополнитьДопПараметры(ДопПараметрыПоУмолчанию, ДопПараметрыДополнения = Неопределено) Экспорт
	
	ДопПараметрыДокумента = Новый Массив();
	ДопПараметрыОбщийСписок = Новый Соответствие();
	ДопПараметрыРезультат = Новый Массив();
	
	Для каждого ДопПараметрДокумента Из ДопПараметрыПоУмолчанию Цикл
		ДопПараметрыОбщийСписок.Вставить(ДопПараметрДокумента.Ключ, ДопПараметрДокумента);
	КонецЦикла;
	
	Если Не ДопПараметрыДополнения = Неопределено Тогда
		Если ДопПараметрыДополнения.УстановленыДопПараметры Тогда
			Если ТипЗнч(ДопПараметрыДополнения.ДопПараметры) = Тип("ХранилищеЗначения") Тогда
				ДопПараметрыДокументаСтрока = ДопПараметрыДополнения.ДопПараметры.Получить();
				Если Не ДопПараметрыДокументаСтрока = Неопределено Тогда
					ДопПараметрыДокумента = ЗначениеИзСтрокиВнутр(ДопПараметрыДокументаСтрока);			
				КонецЕсли;
			ИначеЕсли ТипЗнч(ДопПараметрыДополнения.ДопПараметры) = Тип("Массив") Тогда
				ДопПараметрыДокумента = ДопПараметрыДополнения.ДопПараметры;
			ИначеЕсли ТипЗнч(ДопПараметрыДополнения.ДопПараметры) = Тип("Строка") Тогда
				ДопПараметрыДокумента = ЗначениеИзСтрокиВнутр(ДопПараметрыДополнения.ДопПараметры);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Для каждого ДопПараметрДокумента Из ДопПараметрыДокумента Цикл
		НайденныйДопПараметр = ДопПараметрыОбщийСписок.Получить(ДопПараметрДокумента.Ключ);
		Если Не НайденныйДопПараметр = Неопределено Тогда
			НайденныйДопПараметр.Значение = ДопПараметрДокумента.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ДопПараметрДокумента Из ДопПараметрыОбщийСписок Цикл
		ДопПараметрыРезультат.Добавить(ДопПараметрДокумента);
	КонецЦикла;
	
	Возврат ДопПараметрыРезультат;
	
КонецФункции

// Возвращает структуру параметров, необходимых для получения доп. параметров документа,
// используя метод ДополнительныеПараметрыДокумента()
//
// Параметры:
//   ПрофильКонтрагента - СправочникСсылка.ККСНГ_Контрагенты - Профиль контрагента
//   КодТипаДокумента - Строка - Код типа документа
//   ЭтоДокументУВХД - Булево - Признак использования в бизнес-процессе УВХД
//
// Возвращаемое значение:
//   Структура - Структура параметров для получения доп. параметров документа - Содержит:
//		* ПрофильКонтрагента - СправочникСсылка.ККСНГ_Контрагенты - Профиль контрагента, доп. параметры которого необходимо получить
//		* КодТипаДокумента - Код типа документа в сервисе ЭДО
//		* ЭтоДокументУВХД - Признак использования в бизнес-процессе УВХД для определения необходимости получения доп. параметров
//
Функция СтруктураПолученияДопПараметровДокумента(ДокументСсылка = Неопределено, 
											  	 ПрофильКонтрагента = Неопределено, 
											  	 КодТипаДокумента = Неопределено, 
											  	 Договор = Неопределено) Экспорт
										
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ДокументСсылка", ДокументСсылка);
	СтруктураПараметров.Вставить("ПрофильКонтрагента", ПрофильКонтрагента);
	СтруктураПараметров.Вставить("Договор", Договор);
	СтруктураПараметров.Вставить("КодТипаДокумента", КодТипаДокумента);
		
	Возврат СтруктураПараметров;
	
КонецФункции

// Проверяет заполнение обязательных доп.параметров ЭД
//
// Параметры:
//   ДанныеПроверки - Структура - Данные для проверки заполнения ЭД
//		см. описание СтруктураПолученияДопПараметровДокумента()
//
// Возвращаемое значение:
//   Ответ - Структура - см.описание ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПроверитьЗаполнениеДопПараметровДокумента(ДанныеПроверки, ДокументСсылка = Неопределено) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Если Не ТипЗнч(ДанныеПроверки) = Тип("Массив") Тогда
		Возврат Ответ;		
	КонецЕсли;
		
	Для каждого ДанныеДокумента Из ДанныеПроверки Цикл
		
		Если ТипЗнч(ДанныеДокумента) = Тип("КлючИЗначение") Тогда
			ДанныеДопПараметра = ДанныеДокумента.Значение;
		Иначе
			ДанныеДопПараметра = ДанныеДокумента;
		КонецЕсли;
		
		Если ДанныеДопПараметра.ОбязательноЗаполнение И Не ЗначениеЗаполнено(ДанныеДопПараметра.Значение) Тогда
			
			Если ЗначениеЗаполнено(ДокументСсылка) Тогда
				ШаблонСообщения = "Не заполнен обязательный доп. параметр ""%1"" документа ""%2""";
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ДанныеДопПараметра.Представление, ДокументСсылка);
			Иначе
				ШаблонСообщения = "Не заполнен обязательный доп. параметр ""%1""";
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ДанныеДопПараметра.Представление);
			КонецЕсли;   
			
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьСообщение(Ответ.Журнал, , ТекстСообщения, "-1", "CHP-00001");				
			
		КонецЕсли;
		
		Если ДанныеДопПараметра.Ключ = "document.currency" 
			И НЕ ПустаяСтрока(ДанныеДопПараметра.Значение)
			И НЕ ККСНГ_ОбщегоНазначенияКлиентСервер.ТолькоЛатиницаВСтроке(ДанныеДопПараметра.Значение) Тогда
			
			Если ЗначениеЗаполнено(ДокументСсылка) Тогда
				ШаблонСообщения = "Ошибка заполнения доп. параметра ""%1"" документа ""%2"". Ожидается буквенный код валюты латиницей, согласно классификатору (например, RUB), текущее значение - ""%3"".";
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ДанныеДопПараметра.Представление, ДокументСсылка, ДанныеДопПараметра.Значение);
			Иначе
				ШаблонСообщения = "Ошибка заполнения доп. параметра ""%1"". Ожидается буквенный код валюты латиницей, согласно классификатору (например, RUB), текущее значение - ""%2"".";
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ДанныеДопПараметра.Представление, ДанныеДопПараметра.Значение);
			КонецЕсли;
			
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьСообщение(Ответ.Журнал, , ТекстСообщения, "-1", "CHP-00001");
					
		КонецЕсли;
		
	КонецЦикла;
	
	Ответ.Успех = (Ответ.Журнал.Количество() = 0);
	
	Возврат Ответ;
	
КонецФункции

Функция ДополнительныеПараметрыДокумента(ДанныеДокумента, ДопПараметры = Неопределено) Экспорт
	
	ДопПараметрыДокумента = Неопределено;	
	
	// TODO Исправить эту часть, код типа документа должен приходить в корневой структуре
	Если ДанныеДокумента.Свойство("КодТипаДокумента") Тогда
		КодТипаДокумента = ДанныеДокумента.КодТипаДокумента;
	Иначе
		КодТипаДокумента = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "ДанныеФормата.КодТипаДокумента");
	КонецЕсли;
	
	СоответствиеДопПараметровТипамДокументов = ПолучитьСписокДополнительныхПараметровДокумента(ДопПараметры);
	ДопПараметрыДокумента = СоответствиеДопПараметровТипамДокументов.Получить(КодТипаДокумента);
	ЗаполнитьЗначенияДопПараметровПоУмолчанию(ДопПараметрыДокумента, ДанныеДокумента, ДопПараметры);
	
	Возврат ДопПараметрыДокумента;
	
КонецФункции

// Возвращает признак принадлежности документа к бизнес-процессу УВХД
//
// Параметры:
//   ДокументСсылка - ДокументСсылка.* - Ссылка на объект основной конфигурации
//
// Возвращаемое значение:
//   Булево - Признак принадлежности документа к бизнес-процессу УВХД
//
Функция ЭтоДокументУВХД(ДокументСсылка) Экспорт
	
	ДанныеДоговора = ПолучитьДанныеДоговораУВХДПоДокументу(ДокументСсылка);
	
	Возврат ТипЗнч(ДанныеДоговора) = Тип("Структура");
	
КонецФункции

Функция ПолучитьДанныеДоговораУВХДПоДокументу(ДокументСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	МодульККСНГ_ПМ_РаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
	ДанныеДоговора = МодульККСНГ_ПМ_РаботаСМетаданными.ПолучитьДоговорДокумента(ДокументСсылка);
	
	Возврат ПолучитьДанныеДоговораУВХД(ДанныеДоговора);
	
КонецФункции	

Функция ПолучитьДанныеДоговораУВХД(ДанныеДоговора) Экспорт
	
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(ДанныеДоговора) Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтрагентыДоговорыУВХД.ДоговорУВХД КАК Договор,
	|	ЕСТЬNULL(КонтрагентыДоговорыУВХД.ДоговорУВХД.Id, 0) КАК ИдентификаторДоговора,
	|	ВЫБОР
	|		КОГДА КонтрагентыДоговорыУВХД.ДоговорУВХД = ЗНАЧЕНИЕ(Справочник.ККСНГ_ЭлектронныеДокументы.ПустаяСсылка)
	|			ТОГДА &НомерДоговора1С
	|		ИНАЧЕ КонтрагентыДоговорыУВХД.ДоговорУВХД.Number
	|	КОНЕЦ КАК НомерДоговора,
	|	&ВалютаДоговора КАК ВалютаДоговора
	|ИЗ
	|	Справочник.ККСНГ_Контрагенты.ДоговорыУВХД КАК КонтрагентыДоговорыУВХД
	|ГДЕ
	|	КонтрагентыДоговорыУВХД.Договор1С = &Договор1С";
	
	Запрос.УстановитьПараметр("Договор1С", Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуЗначенияСвойства(ДанныеДоговора.Договор));
	
	Запрос.УстановитьПараметр("НомерДоговора1С", ДанныеДоговора.Номер);
	Запрос.УстановитьПараметр("ВалютаДоговора", ДанныеДоговора.Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ДанныеДоговора = Новый Структура("Договор, ИдентификаторДоговора, НомерДоговора, ВалютаДоговора");
		ЗаполнитьЗначенияСвойств(ДанныеДоговора, Выборка);
		
		Возврат ДанныеДоговора;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьДанныеФорматаДокумента(ДокументСсылка, ПрофильОрганизации, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();	
	
	// Получение данных документа
	ОбщийМодульПолучениеДанных = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПолучениеДанных");
	ЗапросПредставленияЭД = ОбщийМодульПолучениеДанных.ПолучитьПредставлениеЭД(ДокументСсылка);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПредставленияЭД.Журнал);
	
	Если ЗапросПредставленияЭД.Успех Тогда
		
		ДанныеДокумента = ЗапросПредставленияЭД.Результат;
		
		ЗапросНаДополнение = ККСНГ_ОтправкаЭДВызовСервера.ДополнитьДанныеДокументаДаннымиЭДО(ДанныеДокумента, ПрофильОрганизации);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросНаДополнение.Журнал);
		
		Если ЗапросНаДополнение.Успех Тогда
			
			// Получение данных о формате отправляемого документа
			ЗапросДанныхФормата = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДанныеФорматаДокументаЭД(ДанныеДокумента);
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанныхФормата.Журнал);
			
			Если ЗапросДанныхФормата.Успех Тогда
				
				ДанныеФормата = ЗапросДанныхФормата.Результат;
				
				// Обновление кода ЭДО получателя на случай роуминга
				ДанныеДокумента.Вставить("ЭтоРоуминг", Ложь);
				ЗапросКодаЭДО = ККСНГ_ДокументооборотВызовСервера.ПолучитьКодЭДОПолучателя(ДанныеДокумента.ПрофильКонтрагента, 
														ДанныеФормата.КодТипаДокумента, ПрофильОрганизации, ПараметрыАвторизации);
				Если ЗапросКодаЭДО.Успех Тогда
					ДанныеДокумента.Вставить("ЭтоРоуминг", ?(ДанныеДокумента.КодЭДОПолучателя = ЗапросКодаЭДО.Результат, Ложь, Истина));
					ДанныеДокумента.КодЭДОПолучателя = ЗапросКодаЭДО.Результат;
				КонецЕсли;
				
				ДанныеДокумента.Вставить("ДанныеФормата", ДанныеФормата);
				Ответ.Результат = ДанныеДокумента;
				Ответ.Успех = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ПрочитатьДополнительныеРеквизитыДокумента(СвязанныйДокумент) Экспорт
	
	Результат = Неопределено;
	
	МодульМенеджераДопРеквизитыЭД = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("РегистрыСведений.ККСНГ_ПМ_ДопРеквизитыЭД");
	
	НаборЗаписей =  МодульМенеджераДопРеквизитыЭД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СвязанныйДокумент.Установить(СвязанныйДокумент);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Результат = НаборЗаписей[0];
	КонецЕсли;
	         
	Возврат Результат; 
	
КонецФункции

Функция ПолучитьБизнесПроцессПоДокументу(ДокументСсылка) Экспорт
	
	БизнесПроцесс = Неопределено;	
	
	Если ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ИспользуетсяБизнесПроцессУВХД() Тогда
		КонтрагентСбер = ККСНГ_РаботаСКонтрагентамиВызовСервера.ЭтоКонтрагентСбер(ДокументСсылка.Контрагент.ИНН);
		ЭтоДокументУВХД = ККСНГ_ЭлектронныеДокументы.ЭтоДокументУВХД(ДокументСсылка);
		Если КонтрагентСбер И ЭтоДокументУВХД Тогда
			БизнесПроцесс = "УВХД";	
		КонецЕсли;
	КонецЕсли;
	
	Возврат БизнесПроцесс;
	
КонецФункции

Функция ПроверитьСтруктуруАдресаУВХД(СтруктураАдреса) Экспорт
	
	Возврат ЗначениеЗаполнено(СтруктураАдреса.Город)
			И ЗначениеЗаполнено(СтруктураАдреса.Индекс)
			И ЗначениеЗаполнено(СтруктураАдреса.Улица);
	
КонецФункции

Функция ПолучитьСписокДопустимыхВалютУВХД() Экспорт
	
	СписокДопустимыхВалютУВХД = Новый СписокЗначений;
	
	МодульККСНГ_ПМ_РаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
	ТаблицаВалют = МодульККСНГ_ПМ_РаботаСМетаданными.ПолучитьТаблицуВалют();
	 
	Для каждого СтрокаВалюты Из ТаблицаВалют Цикл
		Если НЕ ПустаяСтрока(СтрокаВалюты.БуквенныйКод) 
			И ККСНГ_ОбщегоНазначенияКлиентСервер.ТолькоЛатиницаВСтроке(СтрокаВалюты.БуквенныйКод) Тогда
			СписокДопустимыхВалютУВХД.Добавить(СтрокаВалюты.БуквенныйКод);	
		КонецЕсли;
		
	КонецЦикла;
	
	СписокДопустимыхВалютУВХД.СортироватьПоЗначению();
	
	Возврат СписокДопустимыхВалютУВХД;

КонецФункции	

// Функция - Получить список наименований документа УВХД
//  
//  Возвращает список наименований документов для УВХД
// 
// Возвращаемое значение:
//  СписокЗначений
//
Функция ПолучитьСписокНаименованийДокументаУВХД() Экспорт
	
	СписокДопустимыхНаименований = Новый СписокЗначений;
	
	СписокДопустимыхНаименований.Добавить("Акт сверки");
	СписокДопустимыхНаименований.Добавить("Претензия");
	СписокДопустимыхНаименований.Добавить("Уведомление о смене реквизитов");
	СписокДопустимыхНаименований.Добавить("Разнарядка");
	СписокДопустимыхНаименований.Добавить("Серийные номера");
	СписокДопустимыхНаименований.Добавить("Страховой полис");
	СписокДопустимыхНаименований.Добавить("Прайс-лист");
	СписокДопустимыхНаименований.Добавить("Прочие информационные письма и уведомления");
	СписокДопустимыхНаименований.Добавить("Прочие документы");
	
	СписокДопустимыхНаименований.СортироватьПоЗначению();
	
	Возврат СписокДопустимыхНаименований;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДоступныеДействияДокументаКурьер(Объект)
	
	СписокДействийПоМаске = ККСНГ_ДокументооборотКлиентСервер.ПолучитьСоответствиеМаскиДействийИзСтроки(Объект.Actions);
	
	Если НРег(СокрЛП(Объект.Status)) = "delivered" Тогда

		СписокДействийПоМаске.Вставить("Accept", Истина);
		СписокДействийПоМаске.Вставить("Reject", Истина);

	КонецЕсли;

	Если СписокДействийПоМаске["AcceptWithTicket"] <> Неопределено
		И СписокДействийПоМаске["AcceptWithTicket"] Тогда

		СписокДействийПоМаске.Удалить("Accept");

	КонецЕсли;

	Если СписокДействийПоМаске["RejectWithTicket"] <> Неопределено
		И СписокДействийПоМаске["RejectWithTicket"] Тогда

		СписокДействийПоМаске.Удалить("Reject");

	КонецЕсли;
	
	Возврат СписокДействийПоМаске;
	
КонецФункции

Процедура ОбработатьТипОбъектаXDTO(ЭтоСписок, СвойстваТипа, Результат, ПространствоИмен)

	Если ЭтоСписок Тогда
		Таблица = Новый ТаблицаЗначений;
		Для каждого ТекСвойство Из СвойстваТипа Цикл
			Таблица.Колонки.Добавить(ТекСвойство.Имя);
		КонецЦикла;
		Результат = Таблица;
	ИначеЕсли СвойстваТипа.Количество() > 0 Тогда
		Результат = Новый Структура;
		Для каждого ТекСвойство Из СвойстваТипа Цикл
			ТекИмяСвойства = ТекСвойство.Имя;
			Результат.Вставить(ТекИмяСвойства, СтруктураПоТипуXDTO(ТекСвойство.Тип, ПространствоИмен, ТекСвойство.ВерхняяГраница <> 1));
		КонецЦикла;
	Иначе
		Возврат;
		
	КонецЕсли;	

КонецПроцедуры

// Возвращает структуру с ключами, аналогичными полям указанного типа XDTO
//
// Параметры:
//	ТипXDTO - строка с именем типа или тип объекта XDTO
//	ПространствоИмен - пространство имен
//
// Возвращаемое значение: 
//	Структура
//
// Пример:
//	СтруктураДокумента = СтруктураПоТипуXDTO("type_Document", "http://schemas.datacontract.org/2004/07/Korus.Eds.Api");
//
Функция СтруктураПоТипуXDTO(Знач ТипXDTO, ПространствоИмен, ЭтоСписок = Ложь)
	
	Результат = Неопределено;
				
	Если ТипЗнч(ТипXDTO) = Тип("Строка") Тогда
		
		ИменаТипов = СтрРазделить(ТипXDTO, ".", Ложь);
		
		Если ИменаТипов.Количество() > 0 Тогда
									
			ТипXDTO = ФабрикаXDTO.Тип(ПространствоИмен, ИменаТипов[0]);
			ИменаТипов.Удалить(0);
			
			Для Каждого ИмяТипа Из ИменаТипов Цикл

				Свойство = ТипXDTO.Свойства.Получить(ИмяТипа);
				
				Если Свойство = Неопределено Тогда
					Возврат Результат;
				Иначе
					ЭтоСписок = Свойство.ВерхняяГраница <> 1;
					ТипXDTO = Свойство.Тип;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если ТипЗнч(ТипXDTO) = Тип("ТипОбъектаXDTO") Тогда
		
		СвойстваТипа = ТипXDTO.Свойства;

		ОбработатьТипОбъектаXDTO(ЭтоСписок, СвойстваТипа, Результат, ПространствоИмен);
		
		Возврат Результат;
		
	ИначеЕсли ТипЗнч(ТипXDTO) = Тип("ТипЗначенияXDTO") Тогда
		
		Если ТипXDTO.Имя = "boolean" Тогда
			Результат = Ложь;
			Возврат Результат;
		Иначе
			Возврат Результат;
		КонецЕсли;
		
	Иначе
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

#Область РаботаСИнфополями

Функция ПолучитьПредставлениеДокумента(ДокументСсылка, СчетФактураСсылка)

	Если СчетФактураСсылка = Неопределено Тогда
		ПредставлениеДокумента = Строка(ДокументСсылка);
	Иначе
		ПредставлениеДокумента = Строка(СчетФактураСсылка);	
	КонецЕсли;	
	
	Возврат ПредставлениеДокумента;

КонецФункции

Функция ПолучитьТаблицуИнфоПолей(НастройкиИнфополей, СчетФактураСсылка, ДокументСсылка)

	ТаблицаЗначенийИнфополей  = Неопределено;
	
	Если НастройкиИнфополей.Количество() Тогда
		Если СчетФактураСсылка = Неопределено Тогда
			ТаблицаЗначенийИнфополей = ПолучитьИнфоПоляТаблицей(ДокументСсылка);
		Иначе
			ТаблицаЗначенийИнфополей = ПолучитьИнфоПоляТаблицей(СчетФактураСсылка);	
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ТаблицаЗначенийИнфополей;

КонецФункции

Функция ПроверкаПолейЗаполненныхВручную(Данные)

	ЭлементНастройки = Данные.ЭлементНастройки;
	ТаблицаЗначенийИнфополей = Данные.ТаблицаЗначенийИнфополей;
	КлючИЗначение = Данные.КлючИЗначение;
	МассивЗначенийИнфополей = Данные.МассивЗначенийИнфополей;
	ПредставлениеДокумента = Данные.ПредставлениеДокумента;
	Ответ = Данные.Ответ;
	
	// Проверяем значения полей, заполненных вручную 
	Если ЭлементНастройки.ДоступноЗаполнениеВручную
		И ТипЗнч(ТаблицаЗначенийИнфополей) = Тип("ТаблицаЗначений") Тогда
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ТипПоля", КлючИЗначение.Ключ);                     
		СтруктураПоиска.Вставить("Идентиф", ЭлементНастройки.Идентификатор);
		
		НайдСтроки = ТаблицаЗначенийИнфополей.НайтиСтроки(СтруктураПоиска);
		
		Если НайдСтроки.Количество() Тогда 
			СтруктураИнфополя = ККСНГ_ОбщегоНазначенияВызовСервера.СтрокаТаблицыЗначенийВСтруктуру(НайдСтроки[0]);
			
			Если ЗначениеЗаполнено(СтруктураИнфополя.Значен) Тогда
				
				МассивЗначенийИнфополей.Добавить(СтруктураИнфополя);
				
				ТекстСообщения = СтрШаблон("Значение поля ""%1"" для документа %2 задано вручную - %3.", 
				ЭлементНастройки.Идентификатор, 
				ПредставлениеДокумента, 
				СтруктураИнфополя.Значен);
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, ТекстСообщения);
				
				Возврат Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	

	Возврат Истина;
	
КонецФункции

Процедура ОбработатьЗначениеВычисления(ЭлементНастройки, ИмяПоля, ТаблицаРезультат, МассивЗначенийИнфополей, МассивОшибокЗаполнения)

	Если ЭлементНастройки.ТипИнфополя = "ИнфоФХЖ2" Тогда 
		Для каждого СтрРезультат Из ТаблицаРезультат Цикл
			
			ЗначениеПоля = СтрРезультат[ИмяПоля];
			
			// TODO после добавления флага обязательности заполнения в ТЧ инфополей убрать эту проверку
			Если НЕ ЗначениеПоля = Неопределено
				И НЕ ЗначениеПоля = Null Тогда
				
				ОбработатьИнфоФХЖ2(ЗначениеПоля, ЭлементНастройки, СтрРезультат, МассивОшибокЗаполнения, МассивЗначенийИнфополей);
				
			КонецЕсли;
			
		КонецЦикла;	
	Иначе // Для инфополей кроме ФХЖ2 берем только первую строку результата
		Если ТаблицаРезультат.Количество() Тогда
			
			ЗначениеПоля = ТаблицаРезультат[0][ИмяПоля];
			
			// TODO после добавления флага обязательности заполнения в ТЧ инфополей убрать эту проверку
			Если НЕ ЗначениеПоля = Неопределено
				И НЕ ЗначениеПоля = Null Тогда
				
				ОбработатьИнфоФХЖ13(ЗначениеПоля, ЭлементНастройки, МассивОшибокЗаполнения, МассивЗначенийИнфополей);
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьИнфоФХЖ13(ЗначениеПоля, ЭлементНастройки, МассивОшибокЗаполнения, МассивЗначенийИнфополей)

	Если НЕ ЗначениеЗаполнено(ЗначениеПоля) 
		И ЭлементНастройки.ОбязательноДляЗаполнения Тогда
		
		ТекстОшибки = СтрШаблон("Не заполнено значение поля ""%1"" раздела %2.", 
		ЭлементНастройки.Идентификатор,
		ЭлементНастройки.ТипИнфополя);
		
		МассивОшибокЗаполнения.Добавить(ТекстОшибки);
		
	Иначе
		
		СтруктураИнфополя = Новый Структура;
		СтруктураИнфополя.Вставить("Идентиф", ЭлементНастройки.Идентификатор);
		СтруктураИнфополя.Вставить("Значен", Строка(ЗначениеПоля));
		
		МассивЗначенийИнфополей.Добавить(СтруктураИнфополя);
	КонецЕсли;	

КонецПроцедуры

Процедура ОбработатьИнфоФХЖ2(ЗначениеПоля, ЭлементНастройки, СтрРезультат, МассивОшибокЗаполнения, МассивЗначенийИнфополей)

	Если НЕ ЗначениеЗаполнено(ЗначениеПоля) 
		И ЭлементНастройки.ОбязательноДляЗаполнения Тогда
		
		ТекстОшибки = СтрШаблон("Не заполнено значение поля ""%1"" раздела %2 в строке %3.", 
		ЭлементНастройки.Идентификатор,
		ЭлементНастройки.ТипИнфополя,
		СтрРезультат.НомерСтроки);
		
		МассивОшибокЗаполнения.Добавить(ТекстОшибки);
		
	Иначе	
		СтруктураИнфополя = Новый Структура;
		СтруктураИнфополя.Вставить("Идентиф", ЭлементНастройки.Идентификатор);
		
		СтруктураПолей = ККСНГ_ОбщегоНазначенияВызовСервера.СтрокаТаблицыЗначенийВСтруктуру(СтрРезультат);
		СтруктураПолей.Вставить("ТабличнаяЧасть", ЭлементНастройки.ТабличнаяЧасть);
		
		СтруктураИнфополя.Вставить("ДопПоля", СтруктураПолей);
		СтруктураИнфополя.Вставить("Значен", Строка(ЗначениеПоля));
		
		МассивЗначенийИнфополей.Добавить(СтруктураИнфополя);
		
	КонецЕсли;	

КонецПроцедуры

Процедура СформироватьОтветПоИнфополям(Ответ, МассивОшибокЗаполнения, СтруктураЗначенийИнфополей, ПредставлениеДокумента)

	Если МассивОшибокЗаполнения.Количество() = 0 Тогда
		Ответ.Успех = Истина;
		Ответ.Результат = СтруктураЗначенийИнфополей;
	Иначе
		
		ОбщийТекстОшибки = "Некорректное заполнение инфополей документа " + ПредставлениеДокумента + ":";
		ТекстОшибок = "";
		
		Для каждого СтрокаОшибки Из МассивОшибокЗаполнения Цикл
			ТекстОшибок = ТекстОшибок + Символы.ПС + СтрокаОшибки;	
		КонецЦикла;
		
		ОбщийТекстОшибки = ОбщийТекстОшибки + ТекстОшибок;
			
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОбщийТекстОшибки, "IF-000003");

	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область РаботаСДопПараметрами

Функция ДополнительныйПараметр(Ключ, Значение = "", ОбязательноЗаполнение = Ложь, ВозможноИзменение = Ложь, 
										Представление = Неопределено, СписокДопустимыхЗначений = Неопределено, Комментарий = "")
	
	ДополнительныйПараметр = Новый Структура();
	ДополнительныйПараметр.Вставить("Ключ", Ключ);
	ДополнительныйПараметр.Вставить("Значение", Значение);
	ДополнительныйПараметр.Вставить("ОбязательноЗаполнение", ОбязательноЗаполнение);
	ДополнительныйПараметр.Вставить("ВозможноИзменение", ВозможноИзменение);
	ДополнительныйПараметр.Вставить("Представление", Представление);
	ДополнительныйПараметр.Вставить("ДоступенСписокЗначений", ТипЗнч(СписокДопустимыхЗначений) = Тип("СписокЗначений"));
	ДополнительныйПараметр.Вставить("СписокДопустимыхЗначений", СписокДопустимыхЗначений);
	ДополнительныйПараметр.Вставить("Комментарий", Комментарий);
			
	Возврат ДополнительныйПараметр;		
	
КонецФункции

Функция ПолучитьСписокДополнительныхПараметровДокумента(ДопПараметры = Неопределено)
	
	СоответствиеДопПараметровДокументам = Новый Соответствие();
	
	БизнесПроцесс = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "БизнесПроцесс");
	
	Если БизнесПроцесс = "УВХД" Тогда
		
		СписокДопустимойВалюты = ПолучитьСписокДопустимыхВалютУВХД();
		СписокНаименованийДокумента = ПолучитьСписокНаименованийДокументаУВХД();
		
		ДопПараметр_БизнесПроцесс = ДополнительныйПараметр("business process", , Истина, Ложь, "Бизнес-процесс");
		ДопПараметр_ЭлектроннаяПочтаСотрудника = ДополнительныйПараметр("manager.email", , Ложь, Истина, "Email сотрудника банка");
		ДопПараметр_ПодписьОтправителя = ДополнительныйПараметр("system.senderSignatureRequired", , Истина, Ложь, "Подпись отправителя");
		ДопПараметр_Валюта = ДополнительныйПараметр("document.currency", , Истина, Истина, "Валюта", СписокДопустимойВалюты, "Заполняется буквенным кодом валюты латиницей, согласно классификатору (например, RUB).");
		ДопПараметр_НазначениеДокумента = ДополнительныйПараметр("type", , Ложь, Ложь, "Назначение документа");
		ДопПараметр_НомерДоговораУВХД = ДополнительныйПараметр("uvhd.contract.number", , Истина, Истина, "Номер электронного договора");
		ДопПараметр_НаименованиеДокументаУВХД = ДополнительныйПараметр("document.name", , Истина, Истина, "Наименование документа", СписокНаименованийДокумента);
		
		// Структурированные документы
		ДопПараметрыUPD_DOP = Новый Массив();
		ДопПараметрыUPD_DOP.Добавить(ДопПараметр_БизнесПроцесс);
		ДопПараметрыUPD_DOP.Добавить(ДопПараметр_ЭлектроннаяПочтаСотрудника);
		ДопПараметрыUPD_DOP.Добавить(ДопПараметр_НомерДоговораУВХД);
		
		СоответствиеДопПараметровДокументам.Вставить("UPD_DOP", ДопПараметрыUPD_DOP);
		
		ДопПараметрыUPD_SF = Новый Массив();
		ДопПараметрыUPD_SF.Добавить(ДопПараметр_БизнесПроцесс);
		ДопПараметрыUPD_SF.Добавить(ДопПараметр_ЭлектроннаяПочтаСотрудника);
		ДопПараметрыUPD_SF.Добавить(ДопПараметр_НомерДоговораУВХД);
		
		СоответствиеДопПараметровДокументам.Вставить("UPD_SF", ДопПараметрыUPD_SF);
		
		ДопПараметрыUPD_SF_DOP = Новый Массив();
		ДопПараметрыUPD_SF_DOP.Добавить(ДопПараметр_БизнесПроцесс);
		ДопПараметрыUPD_SF_DOP.Добавить(ДопПараметр_ЭлектроннаяПочтаСотрудника);
		ДопПараметрыUPD_SF_DOP.Добавить(ДопПараметр_НазначениеДокумента);
		ДопПараметрыUPD_SF_DOP.Добавить(ДопПараметр_НомерДоговораУВХД);
		
		СоответствиеДопПараметровДокументам.Вставить("UPD_SF_DOP", ДопПараметрыUPD_SF_DOP);
		
		ДопПараметрыUVHD_BILL = Новый Массив();
		ДопПараметрыUVHD_BILL.Добавить(ДопПараметр_БизнесПроцесс);
		ДопПараметрыUVHD_BILL.Добавить(ДопПараметр_ЭлектроннаяПочтаСотрудника);
		ДопПараметрыUVHD_BILL.Добавить(ДопПараметр_Валюта);
		ДопПараметрыUVHD_BILL.Добавить(ДопПараметр_НомерДоговораУВХД);
		
		СоответствиеДопПараметровДокументам.Вставить("UVHD_BILL", ДопПараметрыUVHD_BILL);
		
		// Неструктурированные документы
		ДопПараметрыACT = Новый Массив();
		ДопПараметрыACT.Добавить(ДопПараметр_БизнесПроцесс);
		ДопПараметрыACT.Добавить(ДопПараметр_ЭлектроннаяПочтаСотрудника);
		ДопПараметрыACT.Добавить(ДопПараметр_Валюта);
		ДопПараметрыACT.Добавить(ДопПараметр_ПодписьОтправителя);
		ДопПараметрыACT.Добавить(ДопПараметр_НомерДоговораУВХД);
		
		СоответствиеДопПараметровДокументам.Вставить("ACT", ДопПараметрыACT);
		
		ДопПараметрыACT_PROD = Новый Массив();
		ДопПараметрыACT_PROD.Добавить(ДопПараметр_БизнесПроцесс);
		ДопПараметрыACT_PROD.Добавить(ДопПараметр_ЭлектроннаяПочтаСотрудника);
		
		СоответствиеДопПараметровДокументам.Вставить("ACT_PROD", ДопПараметрыACT_PROD);
		
		ДопПараметрыDOCUMENT = Новый Массив();
		ДопПараметрыDOCUMENT.Добавить(ДопПараметр_БизнесПроцесс);
		ДопПараметрыDOCUMENT.Добавить(ДопПараметр_ЭлектроннаяПочтаСотрудника);
		ДопПараметрыDOCUMENT.Добавить(ДопПараметр_ПодписьОтправителя);
		ДопПараметрыDOCUMENT.Добавить(ДопПараметр_НаименованиеДокументаУВХД);
		
		СоответствиеДопПараметровДокументам.Вставить("DOCUMENT", ДопПараметрыDOCUMENT);
		
	КонецЕсли;
	
	Возврат СоответствиеДопПараметровДокументам;
	
КонецФункции

Процедура ЗаполнитьЗначенияДопПараметровПоУмолчанию(ДопПараметрыДокумента, ДанныеДокумента, ДопПараметры = Неопределено)
	
	Если Не ТипЗнч(ДопПараметрыДокумента) = Тип("Массив") Тогда
		Возврат;				
	КонецЕсли;
	
	БизнесПроцесс = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "БизнесПроцесс");
	Если БизнесПроцесс = "УВХД" Тогда
		
		ПрофильКонтрагента = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "ПрофильКонтрагента");		
		
		Если ДанныеДокумента.Свойство("ДокументСсылка") И ЗначениеЗаполнено(ДанныеДокумента.ДокументСсылка) Тогда
			ДанныеДоговораУВХД = ПолучитьДанныеДоговораУВХДПоДокументу(ДанныеДокумента.ДокументСсылка);
		ИначеЕсли ДанныеДокумента.Свойство("Договор") И ЗначениеЗаполнено(ДанныеДокумента.Договор) Тогда
			МодульККСНГ_ПМ_РаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
			ДанныеДоговора1С = МодульККСНГ_ПМ_РаботаСМетаданными.ПолучитьДанныеДоговора(ДанныеДокумента.Договор);
			ДанныеДоговораУВХД = ПолучитьДанныеДоговораУВХД(ДанныеДоговора1С);
		Иначе
			ДанныеДоговораУВХД = Неопределено;
		КонецЕсли;
		
		ВалютаПоУмолчанию = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоговораУВХД, "ВалютаДоговора", "");
		Если ЗначениеЗаполнено(ВалютаПоУмолчанию) Тогда
			ВалютаПоУмолчанию = ВалютаПоУмолчанию.Наименование;	
		КонецЕсли;
		
		ЗначениямПоУмолчанию = Новый Соответствие();
		ЗначениямПоУмолчанию.Вставить("business process", "UVHD");
		ЗначениямПоУмолчанию.Вставить("manager.email", ПрофильКонтрагента.СотрудникБанкаEmail);
		ЗначениямПоУмолчанию.Вставить("system.senderSignatureRequired", "true");
		ЗначениямПоУмолчанию.Вставить("document.currency", ВалютаПоУмолчанию);
		ЗначениямПоУмолчанию.Вставить("type", "");
		ЗначениямПоУмолчанию.Вставить("uvhd.contract.number", ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоговораУВХД, "НомерДоговора"));
		ЗначениямПоУмолчанию.Вставить("document.name", ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "НаименованиеДокументаУВХД"));
		
		Для каждого ДопПараметрДокумента Из ДопПараметрыДокумента Цикл
			ДопПараметрДокумента.Значение = ЗначениямПоУмолчанию.Получить(ДопПараметрДокумента.Ключ);		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСоСчетчиками

Функция ПолучитьКоличествоСтрокИзДанныхФормирования(ДанныеФормированияЗапроса)
	
	КоличествоСтрок = 0;
	
	Если ДанныеФормированияЗапроса.Свойство("ТекстЗапроса") Тогда
		
		ТекстЗапроса = ДанныеФормированияЗапроса.ТекстЗапроса;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
		
		Шаблон = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(1) КАК _Счетчик
		|ИЗ
		|	(%1) КАК _ВложенныйЗапрос";
		ТекстЗапроса = СтрШаблон(Шаблон, ТекстЗапроса);
		
		Если ДанныеФормированияЗапроса.Свойство("ПараметрыЗапроса") Тогда
			ПараметрыЗапроса = ДанныеФормированияЗапроса.ПараметрыЗапроса;
			Запрос = Новый Запрос(ТекстЗапроса);
			Для каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
				Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);	
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			Результат = Запрос.Выполнить();
		Исключение
			ТекстОшибки = ОписаниеОшибки();
		КонецПопытки;
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		КоличествоСтрок = Выборка._Счетчик;
		
		//КоличествоСтрок = Результат.Выбрать().Количество();
		
	ИначеЕсли ДанныеФормированияЗапроса.Свойство("Схема") Тогда
		
		Схема = ДанныеФормированияЗапроса.Схема;
		Настройки = ДанныеФормированияЗапроса.Настройки;
				
		КомпоновщикМакета  = Новый КомпоновщикМакетаКомпоновкиДанных();
		Макет = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"), Ложь);
		
		// С учетом отборов
		//ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных();
		//ПроцессорКомпоновкиДанных.Инициализировать(Макет);
		// 
		//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
		//КоличествоСтрок = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных).Количество();
		
		// Без учета отборов
		Запрос = Новый Запрос;
		ТекстЗапроса = Макет.НаборыДанных.НаборДанныхДинамическогоСписка.Запрос;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
		
		Шаблон = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(1) КАК _Счетчик
		|ИЗ
		|	(%1) КАК _ВложенныйЗапрос";
		ТекстЗапроса = СтрШаблон(Шаблон, ТекстЗапроса);
		
		Запрос.Текст = ТекстЗапроса;
		
		Для Каждого Парам из Макет.ЗначенияПараметров Цикл
			Запрос.УстановитьПараметр(Парам.Имя, Парам.Значение);
		КонецЦикла;
		
		Попытка
			Результат = Запрос.Выполнить();
		Исключение
			ТекстОшибки = ОписаниеОшибки();
		КонецПопытки;
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		КоличествоСтрок = Выборка._Счетчик;
		
		//КоличествоСтрок = Выборка.Количество();
				
	КонецЕсли;
	
	Возврат КоличествоСтрок;
	
КонецФункции

Функция ВыполнитьРасчетКоличестваЭлементовВРазделах(ДанныеПоРазделам)
			
	Запрос = Новый Запрос;
	ЧастиТекстаЗапроса = Новый Массив;
	
	КоличествоЗапросовВПакете = 0;
	РазделительЗапросовВПакете = 
		"
		|;
		|";
	 
	ПоложениеРезультатовВПакете = Новый Соответствие;
	
	Для каждого ДанныеРаздела Из ДанныеПоРазделам Цикл
		
		ИмяРаздела = ДанныеРаздела.Ключ;
		ДанныеЗапроса = ДанныеРаздела.Значение;
		
		ТекстЗапроса = ДанныеЗапроса.ТекстЗапроса;
		
		// Обернем запрос в выборку количества
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
		
		Шаблон = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(1) КАК _Счетчик
		|ИЗ
		|	(%1) КАК _ВложенныйЗапрос";
		ТекстЗапроса = СтрШаблон(Шаблон, ТекстЗапроса);
			
		// Переименовываем и устанавливаем параметры запроса.
		Префикс = СтрШаблон("%1_", ИмяРаздела);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&", "&" + Префикс);
		
		// Устанавливаем параметры			
		Для каждого ПараметрЗапроса Из ДанныеЗапроса.ПараметрыЗапроса Цикл
			Запрос.УстановитьПараметр(Префикс + ПараметрЗапроса.Имя, ПараметрЗапроса.Значение);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ЧастиТекстаЗапроса) Тогда
			ЧастиТекстаЗапроса.Добавить(РазделительЗапросовВПакете);
		КонецЕсли;
		
		ТекстЗапросаВПакете = СтрШаблон(
			"////////////////////////////////////////////////////////////////////////////
			|// %1
			|
			|%2", ИмяРаздела, ТекстЗапроса);
		ЧастиТекстаЗапроса.Добавить(ТекстЗапросаВПакете);
			
		
		// Вычисляем положение результата по разделу в пакете.
		КоличествоЗапросовВПакете = КоличествоЗапросовВПакете + 1;
		
		ПоложениеРезультатовВПакете.Вставить(ИмяРаздела, КоличествоЗапросовВПакете - 1);
				      		
	КонецЦикла;	
	
	// Заполняем результаты по разделам по данным пакета.
	Запрос.Текст = СтрСоединить(ЧастиТекстаЗапроса);
	Результаты = Запрос.ВыполнитьПакет();
	
	РезультатыПоРазделам = Новый Соответствие();
	
	Для каждого ДанныеРаздела Из ДанныеПоРазделам Цикл
		
		ИмяРаздела = ДанныеРаздела.Ключ;
		КоличествоЭлементов = 0;
			
		ИндексРезультата = ПоложениеРезультатовВПакете.Получить(ИмяРаздела);
		
		Если НЕ ИндексРезультата = Неопределено Тогда
		
			Результат = Результаты[ИндексРезультата];
			
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
			
				Пока Выборка.Следующий() Цикл
					КоличествоЭлементов = КоличествоЭлементов + Выборка._Счетчик;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		РезультатыПоРазделам.Вставить(ИмяРаздела, КоличествоЭлементов);
		
	КонецЦикла;
	
	Возврат РезультатыПоРазделам;
	
КонецФункции

#КонецОбласти

#КонецОбласти
